{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "layer_00", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer_00", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "variationalDropout", "config": {"name": "layer_01", "trainable": true, "dtype": "float32", "rate": 0.95, "noise_shape": null, "seed": null}, "name": "layer_01", "inbound_nodes": [[["layer_00", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "layer_02", "trainable": true, "dtype": "float32", "units": 3, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer_02", "inbound_nodes": [[["layer_01", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["layer_02", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}